Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The startup health check will be available either at `http://localhost:8080/q/health/started` or together with other health check procedure at `http://localhost:8080/q/health`.
ja_jp: `http://localhost:8080/q/health/live` エンドポイントにブラウザか、 `curl http://localhost:8080/q/health/live` でアクセスします:

source: The startup is a bit slower than usual: it is mostly due to us dropping and recreating the Elasticsearch mapping every time at startup. We also index some initial data.
ja_jp: 起動は通常より少し遅くなります。これは主に、起動時に毎回 Elasticsearch マッピングを削除して再作成するためです。 いくつかの初期データのインデックスも作成します。

source: The startup is a bit slower than usual: it is mostly due to us dropping and recreating the database schema and the Elasticsearch mapping every time at startup. We also inject some data and execute the mass indexer.
ja_jp: 起動がいつもより少し遅いのは、起動時に毎回データベーススキーマとElasticsearchマッピングを落として再作成しているのが原因です。また、いくつかのデータを注入し、マスインデクサーを実行しています。

source: The state associated with the current user session is stored on the server.
ja_jp: 現在のユーザーセッションに関連付けられた状態はサーバー上に保存されます。

source: The state cookie SameSite status
ja_jp: State Cookie の SameSite ステータス

source: The state in Dev UI uses https://github.com/gitaarik/lit-state[LitState]. You can read more about it in their https://gitaarik.github.io/lit-state/build/[documentation].
ja_jp: Dev UI の状態は https://github.com/gitaarik/lit-state[LitState] を使用します。詳細は、 https://gitaarik.github.io/lit-state/build/[ドキュメント] を参照してください。

source: The state of the servers is visible, stop and restart is available with a right-click, and you can enable different levels of tracing:
ja_jp: サーバーの状態を見ることができ、右クリックで停止と再起動が可能で、さまざまなレベルのトレースを有効にすることができる：

source: The static `io.fabric8.kubernetes.client.utils.Serialization` utils class is deprecated and should not be used. Access to `Serialization.jsonMapper()` should be replaced by the usage of @KubernetesClientObjectMapperCustomizer` declared beans.
ja_jp: 静的な `io.fabric8.kubernetes.client.utils.Serialization` utils クラスは非推奨であり、使用すべきではありません。 `Serialization.jsonMapper()` へのアクセスは @KubernetesClientObjectMapperCustomizer` で宣言された Bean を使用することで置き換える必要があります。

source: The static `io.fabric8.kubernetes.client.utils.Serialization` utils class is deprecated and should not be used. Access to `Serialization.jsonMapper()` should be replaced by the usage of `@KubernetesClientObjectMapperCustomizer` declared beans.
ja_jp: 静的な `io.fabric8.kubernetes.client.utils.Serialization` utils クラスは非推奨であり、使用すべきではありません。 `Serialization.jsonMapper()` へのアクセスは、 `@KubernetesClientObjectMapperCustomizer` で宣言された Bean の使用に置き換える必要があります。

source: The steps described in this tutorial should work exactly as the tutorial describes. You might have to clear the browser cookies when accessing the updated Quarkus endpoint if you have already completed the authentication. You might need to restart the Quarkus application manually in dev mode but it is not expected. If you need help completing this tutorial, you can get in touch with the Quarkus team.
ja_jp: このチュートリアルで説明された手順は、チュートリアルで説明されたとおりに動作するはずです。すでに認証を完了している場合は、更新後の Quarkus エンドポイントにアクセスする際にブラウザーの Cookie をクリアする必要があることもあります。開発モードで Quarkus アプリケーションを手動で再起動する必要がある可能性もありますが、これhら想定されていません。このチュートリアルを完了するのにサポートが必要な場合は、Quarkus チームにお問い合わせください。

source: The steps in this tutorial guide you through building an application that provides the following endpoints:
ja_jp: このチュートリアルでは、以下のエンドポイントを提供するアプリケーションを構築する方法を説明します:

source: The steps to get this quickstart running are exactly the same as defined in the xref:amazon-lambda-http.adoc[Amazon Lambda HTTP Guide]. These differences are that you are running from a quickstart and the maven dependencies are slightly different.
ja_jp: このクイックスタートを実行するための手順は、 link:amazon-lambda-http.html[Amazon Lambda HTTP Guide] で定義されているものと全く同じです。違いは、クイックスタートから実行していることと、maven の依存関係が若干異なることです。

source: The steps to get this quickstart running are exactly the same as defined in the xref:amazon-lambda-http.adoc[Amazon Lambda HTTP Guide]. This differences are that you are running from a quickstart and the maven dependencies are slightly different.
ja_jp: このクイックスタートを実行する手順は、 xref:amazon-lambda-http.adoc[Amazon Lambda HTTP Guide] で定義されているものとまったく同じです。 この違いは、クイックスタートから実行することと、mavenの依存関係が若干異なることです。

source: The steps to get this quickstart running are exactly the same as defined in the xref:aws-lambda-http.adoc[AWS Lambda HTTP Guide]. These differences are that you are running from a quickstart and the maven dependencies are slightly different.
ja_jp: このクイックスタートを実行する手順は、 xref:aws-lambda-http.adoc[AWS Lambda HTTP ガイド] で定義されているものと全く同じです。これらの違いは、クイックスタートから実行することと、Mavenの依存関係が若干異なることです。

source: The steps to get this quickstart running are exactly the same as defined in the xref:gcp-functions-http.adoc[Google Cloud Functions HTTP Guide]. These differences are that you are running from a quickstart and the Maven dependencies are slightly different.
ja_jp: このクイックスタートを実行するための手順は、 link:gcp-functions-http.html[Google Cloud Functions HTTP Guide] で定義されているものと全く同じです。違いは、クイックスタートから実行することと、Maven の依存関係が若干異なることです。

source: The steps to get this quickstart running are exactly the same as defined in the xref:gcp-functions-http.adoc[Google Cloud Functions HTTP Guide]. This differences are that you are running from a quickstart and the Maven dependencies are slightly different.
ja_jp: このクイックスタートを実行する手順は、 xref:gcp-functions-http.adoc[Google Cloud Functions HTTP Guide] で定義されているものとまったく同じです。 この違いは、クイックスタートから実行することと、Maven の依存関係が若干異なることです。

source: The strategies available for generating the Operation Id
ja_jp: 操作Idを生成するために利用可能な戦略

source: The strategy is selected using the `failure-strategy` attribute.
ja_jp: ストラテジーは `failure-strategy` 属性を使用して選択します。

source: The stream example from above becomes:
ja_jp: 上からのストリームの例は以下のようになります。

source: The streams metadata for the given weather station id is obtained
ja_jp: 与えられた station id のストリームメタデータが取得されます

source: The strict rendering enables the developers to catch insidious errors caused by typos and invalid expressions. If enabled then any expression that cannot be resolved, i.e. is evaluated to an instance of `io.quarkus.qute.Results.NotFound`, will always result in a `TemplateException` and the rendering is aborted. A `NotFound` value is considered an error because it basically means that no value resolver was able to resolve the expression correctly.
ja_jp: strict レンダリングにより、開発者は、タイプミスや無効な式によって引き起こされるわかりにくいエラーをキャッチすることができます。この機能を有効にすると、解決できない式、つまり `io.quarkus.qute.Results.NotFound` のインスタンスとして評価される式は、常に `TemplateException` となり、レンダリングは中断されます。`NotFound` 値は基本的に、値リゾルバーが式を正しく解決できなかったことを意味するため、エラーとみなされます。

source: The string value is recorded in the bytecode and used to initialize the instance of `Foo`.
ja_jp: 文字列の値はバイトコードに記録され、 `Foo` のインスタンス初期化に使用されます。

source: The string value used can be any of one of the `de.flapdoodle.embed.mongo.distribution.Version` or `de.flapdoodle.embed.mongo.distribution.Version.Main` enums. If no version is specified, `Version.Main.V4_0` is used by default.
ja_jp: 使用する文字列の値は `de.flapdoodle.embed.mongo.distribution.Version` または `de.flapdoodle.embed.mongo.distribution.Version.Main` のいずれかの列挙型になります。 バージョンを指定しない場合、デフォルトで `Version.Main.V4_0` が使用されます。

source: The structured approach allows simple forwarding across multiple protocols. However, it may not be efficient and may constraint the type of business data.
ja_jp: 構造化されたアプローチでは、複数のプロトコルをまたいで簡単に転送することができます。しかし、効率的でない場合があり、ビジネスデータの種類を制約する場合があります。

source: The structured approach keeps event metadata and data together in the payload of the message or request. It generally uses JSON to encode that data. If you pass the Cloud Event example (from above), in an HTTP request, it will use the structured mode. It will also use the structured mode when you write that JSON snippet in a Kafka record's value.
ja_jp: 構造化されたアプローチは、イベントのメタデータとデータをメッセージやリクエストのペイロードにまとめて保持します。一般的には JSON を使用してデータをエンコードします。Cloud Event の例 (上記) を HTTP リクエストで渡すと、構造化モードを使用します。また、Kafka レコードの値にその JSON スニペットを書き込む場合も構造化モードを使用します。

source: The stub class names are derived from the service name used in your `proto` file. For example, if you use `Greeter` as a service name as in:
ja_jp: スタブクラス名は、 `proto` ファイルで使用されているサービス名に由来します。例えば、 `Greeter` をサービス名として使用している場合は以下のようになります。

source: The style system currently in use is https://getbootstrap.com/docs/4.6/getting-started/introduction/[Bootstrap V4 (4.6.0)] but note that this might change in the future.
ja_jp: 現在使用されているスタイルシステムは link:https://getbootstrap.com/docs/4.6/getting-started/introduction/[Bootstrap V4(4.6.0)] ですが、将来的に変更される可能性があるので注意してください。

source: The successful graduation of Apache Polaris as a Top-Level Project, combined with the power and efficiency gained from its foundation on Quarkus, is merely the launchpad for a significant, forward-looking technical agenda. Polaris is positioned not just for growth, but to actively shape the future of cloud-native data lakehouse architectures.
ja_jp: Apache Polarisがトップレベルプロジェクトとして成功裏に昇格したことと、Quarkusを基盤とすることで得られたパワーと効率は、将来を見据えた重要な技術的課題の出発点に過ぎません。Polarisは、成長のためだけでなく、クラウドネイティブなデータレイクハウスアーキテクチャの未来を積極的に形作る立場にあります。

source: The suggested project creation command lines disable the codestarts to avoid including a REST server. Similarly, if you use code.quarkus.io to generate a project, you need to go to *MORE OPTIONS -> Starter Code* and select *No* to avoid adding the Quarkus REST (formerly RESTEasy Reactive) extension.
ja_jp: 推奨のプロジェクト作成コマンドでは、RESTサーバーを含めないようにするため、codestartsを無効にします。 同様に、code.quarkus.ioを使用してプロジェクトを生成する場合は、 *MORE OPTIONS → Starter Code* で *No* を選択して、Quarkus REST（旧RESTEasy Reactive）エクステンションを追加しないようにする必要があります。

source: The suggested project creation command lines disable the codestarts to avoid including a REST server. Similarly, if you use code.quarkus.io to generate a project, you need to go to *MORE OPTIONS -> Starter Code* and select *No* to avoid adding the RESTEasy Reactive extension.
ja_jp: プロジェクト作成の推奨コマンドラインでは、RESTサーバーを含めないようにするため、codestartsを無効にしています。同様に、code.quarkus.ioを使用してプロジェクトを生成する場合、 *MORE OPTIONS → Starter Code* で *No* を選択して、RESTEasy Reactiveエクステンションを追加しないようにする必要があります。

source: The sum of the values recorded.
ja_jp: 記録された値の合計。

source: The support for Apache Camel on top of Quarkus is provided by the https://github.com/apache/camel-quarkus[Apache Camel Quarkus project]. Please refer to https://camel.apache.org/camel-quarkus/[their documentation] for more information.
ja_jp: Quarkus上のApache Camelのサポートは、 link:https://github.com/apache/camel-quarkus[Apache Camel Quarkusプロジェクト]によって提供されています。詳細は https://camel.apache.org/camel-quarkus/[彼らのドキュメント] を参照してください。

source: The support for Apache Camel on top of Quarkus is provided by the https://github.com/apache/camel-quarkus[Apache Camel Quarkus project]. Please refer to https://camel.apache.org/camel-quarkus/latest/[their documentation] for more information.
ja_jp: Quarkus上のApache Camelのサポートは、 link:https://github.com/apache/camel-quarkus[Apache Camel Quarkusプロジェクト]によって提供されています。詳細は link:https://camel.apache.org/camel-quarkus/latest/[彼らのドキュメント]を参照してください。

source: The support for Maven 3.9
ja_jp: Maven 3.9サポート

source: The support for multiple persistence units is described in detail in xref:hibernate-orm.adoc#multiple-persistence-units[the Hibernate ORM guide].
ja_jp: 複数の永続化ユニットのサポートについては link:hibernate-orm.html#multiple-persistence-units[Hibernate ORMガイド]で詳しく説明されています。

source: The syntax for the property name is `quarkus.cache."cache-name".type`. If no explicit backend is defined for a cache, the default backend is used. For details on configuring a specific backend, refer to its guide.
ja_jp: プロパティー名の構文は `quarkus.cache."cache-name".type` です。キャッシュに対して明示的なバックエンドが定義されていない場合、デフォルトのバックエンドが使用されます。特定のバックエンドの設定に関する詳細は、そのガイドを参照してください。

source: The syntax is best explained with an example. Let's assume that a `MyComponent` bean has been created like so:
ja_jp: 構文の説明には、例を使用するとわかりやすいでしょう。 `MyComponent` Bean が以下のように作成されたと仮定しましょう。

source: The syntax used in CRON expressions is controlled by the `quarkus.scheduler.cron-type` property. The values can be `cron4j`, `quartz`, `unix` and `spring`. `quartz` is used by default.
ja_jp: CRON 式で使用される構文は `quarkus.scheduler.cron-type` プロパティーによって制御されます。 値は `cron4j` , `quartz` , `unix` および `spring` のいづれかです。 `quartz` がデフォルトで使用されます。

source: The syslog handler in Quarkus follows the link:https://en.wikipedia.org/wiki/Syslog[Syslog] protocol, which is used to send log messages on UNIX-like systems. It uses the protocol defined in link:https://tools.ietf.org/html/rfc5424[RFC 5424].
ja_jp: Quarkus の syslog ハンドラーは、 https://en.wikipedia.org/wiki/Syslog[Syslog] プロトコルに従います。このプロトコルは、UNIX ライクなシステムでログメッセージを送信するために使用されます。 このログハンドラーは、link:https://tools.ietf.org/html/rfc5424[RFC 5424] で定義されたプロトコルを使用します。

source: The syslog handler in Quarkus follows the link:https://en.wikipedia.org/wiki/Syslog[Syslog] protocol, which is used to send log messages on UNIX-like systems. It utilizes the protocol defined in link:https://tools.ietf.org/html/rfc5424[RFC 5424].
ja_jp: Quarkusのsyslogハンドラは、UNIXライクなシステムでログメッセージを送信するために使用される link:https://en.wikipedia.org/wiki/Syslog[Syslog] プロトコルに従っています。 link:https://tools.ietf.org/html/rfc5424[RFC5424] で定義されているプロトコルを使用します。

source: The syslog handler sends all log events to a syslog server (by default, the syslog server that is local to the application). It is disabled by default.
ja_jp: syslog ハンドラーは、すべてのログイベントを syslog サーバー (デフォルトでは、アプリケーションのローカルにある syslog サーバー) に送信します。デフォルトでは無効になっています。

source: The system as a whole should
ja_jp: システム全体としては

source: The system is almost complete. We only need to configure Stork and the `Registration` bean.
ja_jp: システムはほぼ完成です。あとはStorkと `Registration` Beanを設定するだけです。

source: The system is almost complete. We only need to deploy the REST Client interface and the client service to the cluster. In the `src/main/resources/application.properties`, add:
ja_jp: システムはほぼ完成しています。あとは REST Client インターフェイスとクライアントサービスをクラスターにデプロイするだけです。 `src/main/resources/application.properties` に以下を追加します:

source: The system property must be set early on to be effective, so it is recommended to configure it in the build system.
ja_jp: このシステム・プロパティは早い段階で設定しておかないと効果がないので、ビルド・システムで設定することをお勧めします。

source: The table below describe all the available configuration options.
ja_jp: 以下の表は、利用可能なすべての設定オプションについて説明しています。

source: The table below gives an overview of the current IDEs with links and a high-level overview of their features.
ja_jp: 下の表では、現在のIDEの概要とリンク、その機能のハイレベルな概要をご紹介しています。

source: The table below summarizes the supported annotations:
ja_jp: 下の表は、サポートされているアノテーションをまとめたものです。

source: The takeaway is simple: when you notice something odd, report it, we might be able to improve it.
ja_jp: 要点はシンプルです。何かおかしいことに気づいたら報告してください。私たちはそれを改善できるかもしれません。

source: The target file name we want to use in docs is:
ja_jp: docs で使いたいターゲットファイル名は。

source: The target info file contains information such as the target platform, the toolchain used to compile the executable, and the C library in use:
ja_jp: ターゲット情報ファイルには、ターゲットプラットフォーム、実行ファイルのコンパイルに使用されたツールチェーン、使用されているCライブラリなどの情報が含まれています。

source: The target partition id. -1 to let the client determine the partition Type: _int_
ja_jp: 対象のパーティション ID 。 -1 を設定すると、クライアントがパーティションを決定します。 Type: _int_

source: The target resource coordinates are determined based on the type of Operator and the kind of service.
ja_jp: 対象リソース座標は、Operator のタイプとサービスの kind に応じて決定されます。

source: The target resource name does not match the datasource name
ja_jp: ターゲットリソース名がデータソース名と一致しない

source: The target resource name is set by default to match the service kind, such as `postgresql`, `mysql`, `mongo`.
ja_jp: ターゲットリソース名は、デフォルトでは `postgresql`、`mysql`、`mongo` などのサービスの kind に一致するように設定されます。

source: The task name is the name of the extension that performs the initialization. Examples:
ja_jp: タスク名は初期化を実行するエクステンションの名前です。例

source: The tasks described below fall into 3 categories:
ja_jp: 以下に説明するタスクは 3 つのカテゴリーに分類されます。

source: The tax application is based on a containerized microservices architecture with each service split up based on the business need. One advantage is that this allows the development team to easily replace a service with different business logic if needed.
ja_jp: 税務アプリケーションは、コンテナ化されたマイクロサービスアーキテクチャをベースに、ビジネスニーズに応じて各サービスが分割されています。これにより、必要に応じて開発チームがサービスを異なるビジネスロジックに簡単に置き換えることができるという利点があります。

source: The tax application is cloud-native and flexible so that it can be used by different cantons and municipalities across the country. Quarkus was analyzed against other Java frameworks and platforms and selected to be the backbone for this application because of its performance, efficiency, and developer productivity in a Kubernetes environment.
ja_jp: この税務アプリケーションは、国内のさまざまな州や市町村で使用できるように、クラウドネイティブで柔軟性に富んでいます。Quarkusは、他のJavaフレームワークやプラットフォームと比較して分析され、パフォーマンス、効率性、Kubernetes環境での開発者の生産性が評価され、このアプリケーションのバックボーンとして選ばれました。

source: The team specifically highlighted Quarkus’ performance, vast extension ecosystem, native compilation, and developer productivity tools (live reloading, Dev UI) as contributing factors in the decision to utilize Quarkus.
ja_jp: チームは、Quarkusのパフォーマンス、広大なエクステンションエコシステム、ネイティブコンパイル、開発者の生産性向上のためのツール（ライブリロード、Dev UI）をQuarkusの採用を決定する要因として特に強調しました。

source: The team thought it was better to have _some_ caching capability to start with, than having nothing; you can expect better caching solution to be integrated in future releases, and any help and feedback in this area is very welcome.
ja_jp: Quarkusの開発チームは最初から _ある程度の_ キャッシュ機能があった方が何もないよりは良いと考えました。将来のリリースではより良いキャッシュソリューションが統合されることを期待しています。

source: The template content is passed directly, i.e. not obtained via an `io.quarkus.qute.TemplateLocator`,
ja_jp: テンプレートの内容は、`io.quarkus.qute.TemplateLocator` を介して取得されるのではなく、直接渡されます。

source: The template file will always be created under the project’s existing `src/main/resources/templates` directory, and will otherwise create the necessary directory to store templates.
ja_jp: テンプレートファイルは常にプロジェクトの既存の `src/main/resources/templates` ディレクトリの下に作成されます。なければ、テンプレートを格納するために必要なディレクトリを作成します。

source: The template is simple:
ja_jp: テンプレートはシンプルです:

source: The template path for this method will be `items/item-and-order`.
ja_jp: このメソッドのテンプレートパスは、 `items/item-and-order` になります。

source: The template path of a `@CheckedTemplate` method consists of the _base path_ and a _defaulted name_. The _base path_ is supplied by the `@CheckedTemplate#basePath()`. By default, the simple name of the declaring class for a nested static class or an empty string for a top level class is used. The _defaulted name_ is derived by the strategy specified in `@CheckedTemplate#defaultName()`. By default, the name of the `@CheckedTemplate` method is used as is.
ja_jp: `@CheckedTemplate` メソッドのテンプレートパスは、 _ベースパス_ と _デフォルトの名前_ から構成されます。 _ベースパス_ は `@CheckedTemplate#basePath()` で指定されます． デフォルトでは，ネストした静的クラスの場合は宣言クラスのsimple name，トップレベルクラスの場合は空文字列が使用されます． _デフォルトの名前_ は， `@CheckedTemplate#defaultName()` で指定された戦略によって導出されます。 デフォルトでは、 `@CheckedTemplate` のメソッドの名前がそのまま使われます。

source: The template rendering is divided in two phases. During the first phase, which is asynchronous, all expressions in the template are resolved and a _result tree_ is built. In the second phase, which is synchronous, the result tree is _materialized_, i.e. one by one the result nodes emit chunks that are consumed/buffered by the specific consumer.
ja_jp: テンプレートのレンダリングは2つのフェーズに分かれています。最初のフェーズ(非同期)では、テンプレート内のすべての式が解決され、 _結果ツリー_ が構築されます。同期的な第2フェーズでは、結果ツリーが _マテリアライズされ_ 、結果ノードが1つずつ、特定のコンシューマによって消費/バッファリングされるチャンクを出力します。

source: The templating engine can also be very useful for rendering periodic reports. You'll need to add the `quarkus-scheduler` and `quarkus-qute` extensions first. In your `pom.xml` file, add:
ja_jp: テンプレートエンジンは、定期的なレポートをレンダリングする場合にも非常に便利なことがあります。 まず `quarkus-scheduler` および `quarkus-qute` エクステンションを追加する必要があります。 `pom.xml` ファイルに以下を追加します。

source: The tenant configuration determines how the session cookie is verified and refreshed. Before the tenant resolution begins, the authorization code flow `session cookie` is used to set the already resolved tenant configuration id as a RoutingContext `tenant-id` attribute: both custom dynamic `TenantConfigResolver` and static `TenantResolver` tenant resolvers can check it.
ja_jp: テナント設定によって、セッション Cookie の検証方法と更新方法が決まります。テナント解決が始まる前に、認可コードフロー `session cookie` を使用して、すでに解決されたテナント設定 ID を RoutingContext `tenant-id` 属性として設定します。カスタム動的 `TenantConfigResolver` テナントリゾルバーと静的 `TenantResolver` テナントリゾルバーの両方がこれを確認できます。

source: The tenant-paths
ja_jp: テナントパス

source: The test also injects a mock for `Charlie`. The injected reference is an "unconfigured" Mockito mock.
ja_jp: このテストは `Charlie` のモックも注入します。注入された参照は「未設定」のMockitoモックです。

source: The test also injects a mock for `Charlie`. `Charlie` is an _unsatisfied_ dependency for which a synthetic `@Singleton` bean is registered automatically. The injected reference is an "unconfigured" Mockito mock.
ja_jp: このテストは `Charlie` のモックも注入します。 `Charlie` は、 `@Singleton` 合成 Bean が自動的に登録される、_満たされていない_ 依存関係です。注入される参照は、"未設定" の Mockito モックです。

source: The test can be easily run by issuing:
ja_jp: このテストは、 `./mvnw test` を発行することで簡単に実行できます。

source: The test code itself can be easily debugged with any of the well known methods (like launching the test from the IDE, adding `-Dmaven.failsafe.debug` if the test is launched via Maven, etc.), but the application under test needs to have the necessary flags passed to it via `quarkus.test.arg-line` to enable debugging. For testing an application packaged as *jar*, you can use:
ja_jp: テストコード自体は、よく知られているどの方法でも簡単にデバッグできます (IDE からテストを起動したり、Maven 経由でテストを起動する場合は `-Dmaven.failsafe.debug` を追加したりするなど)。しかし、テスト対象のアプリケーションは、デバッグを有効にするために `quarkus.test.arg-line` 経由で必要なフラグを渡す必要があります。 *jar* としてパッケージ化されたアプリケーションをテストする場合は、次を使用できます。

source: The test injects the component under the test - `PersonService`.
ja_jp: このテストは、テスト対象のコンポーネントである `PersonService` を注入します。

source: The test injects the component under the test. The types of all fields annotated with `@Inject` are considered the component types under test. You can also specify additional component classes via `@QuarkusComponentTest#value()`. Furthermore, the static nested classes declared on the test class are components too.
ja_jp: このテストはテスト対象のコンポーネントを注入します。 `@Inject` でアノテーションが付けられたすべてのフィールドの型が、テスト対象のコンポーネント型とみなされます。 `@QuarkusComponentTest#value()` を使用して追加のコンポーネントクラスを指定することもできます。さらに、テストクラスで宣言された静的ネストクラスもコンポーネントです。

source: The test injects the component under the test. `Foo` injects `Charlie`.
ja_jp: テストはテスト対象のコンポーネントを挿入します。`Foo` は `Charlie` を挿入します。

source: The test port can be controlled via the `quarkus.http.test-port` config property.
ja_jp: テストポートは、 `quarkus.http.test-port` 設定プロパティーで制御できます。

source: The test port can be controlled via the `quarkus.http.test-port` config property. Quarkus also creates a system property called `test.url` that is set to the base test URL for situations where you cannot use injection.
ja_jp: テストポートは、 `quarkus.http.test-port` 設定プロパティーで制御できます。Quarkus はまた、インジェクションを使用できない場合のためにベースとなるテストURLに設定される `test.url` というシステムプロパティーを作成します。

source: The test scenarios will be run as part of the JUnit test suite.
ja_jp: テストシナリオは、JUnitテストスイートの一部として実行されます。

source: The testcase for validating that the `RuntimeXmlConfigService` has started can be found in the `testRuntimeXmlConfigService` test of `ConfiguredBeanTest` and `NativeImageIT`.
ja_jp: `RuntimeXmlConfigService` が開始されたことを検証するテストケースは、 `ConfiguredBeanTest` と `NativeImageIT` の `testRuntimeXmlConfigService` テストにあります。
